; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	image1 - mode
	thermograph0 - mode
	image2 - mode
	GroundStation13 - direction
	GroundStation10 - direction
	GroundStation12 - direction
	GroundStation3 - direction
	Star4 - direction
	Star0 - direction
	Star11 - direction
	GroundStation8 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation6 - direction
	Star9 - direction
	GroundStation1 - direction
	Star7 - direction
	GroundStation14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star7)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star5)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon16)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation12)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
	(supports instrument6 image1)
	(supports instrument6 image2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star11)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 GroundStation12)
	(supports instrument7 image2)
	(supports instrument7 thermograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation12)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 Star4)
	(supports instrument8 image1)
	(supports instrument8 image2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument9 image1)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star0)
	(calibration_target instrument10 GroundStation2)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument11 image1)
	(calibration_target instrument11 Star11)
	(calibration_target instrument11 GroundStation2)
	(supports instrument12 image1)
	(supports instrument12 image2)
	(calibration_target instrument12 Star5)
	(calibration_target instrument12 Star7)
	(calibration_target instrument12 GroundStation2)
	(calibration_target instrument12 GroundStation8)
	(supports instrument13 thermograph0)
	(supports instrument13 image2)
	(calibration_target instrument13 GroundStation14)
	(calibration_target instrument13 Star7)
	(calibration_target instrument13 GroundStation1)
	(calibration_target instrument13 Star9)
	(calibration_target instrument13 GroundStation6)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation6)
)
(:goal (and
	(pointing satellite0 Star9)
	(pointing satellite1 GroundStation8)
	(pointing satellite2 Star0)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 image2)
	(have_image Phenomenon17 thermograph0)
))

)

; plan
1. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 6
2. (calibrate satellite2 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 0 of 6
3. (turn_to satellite2 phenomenon16 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon16)
   goals met: 0 of 6
4. (take_image satellite2 phenomenon16 instrument7 image2)
   added: (have_image phenomenon16 image2)
   goals met: 1 of 6
5. (turn_to satellite2 phenomenon15 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 6
6. (turn_to satellite0 star9 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star9)
   goals met: 2 of 6
7. (take_image satellite2 phenomenon15 instrument7 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 3 of 6
8. (turn_to satellite1 groundstation8 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 groundstation8)
   goals met: 4 of 6
9. (turn_to satellite2 phenomenon17 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon17)
   goals met: 4 of 6
10. (take_image satellite2 phenomenon17 instrument7 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 5 of 6
11. (turn_to satellite2 star0 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star0)
   goals met: 6 of 6
